; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared3 - mode
	spectrograph2 - mode
	image0 - mode
	spectrograph5 - mode
	thermograph1 - mode
	thermograph6 - mode
	infrared4 - mode
	Star0 - direction
	Star3 - direction
	GroundStation5 - direction
	Star8 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation1 - direction
	GroundStation9 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph5)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 thermograph6)
	(supports instrument3 spectrograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image0)
	(supports instrument4 infrared3)
	(supports instrument4 infrared4)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation11)
)
(:goal (and
	(have_image Phenomenon13 spectrograph2)
	(have_image Phenomenon13 thermograph6)
	(have_image Planet14 image0)
	(have_image Planet14 infrared4)
	(have_image Planet15 infrared3)
	(have_image Planet15 thermograph6)
	(have_image Phenomenon16 spectrograph5)
	(have_image Phenomenon16 thermograph1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (turn_to satellite1 groundstation1 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 8
4. (turn_to satellite0 phenomenon16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 8
5. (turn_to satellite1 groundstation6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 8
6. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 0 of 8
7. (turn_to satellite1 groundstation1 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 8
8. (turn_to satellite1 phenomenon13 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon13)
   goals met: 0 of 8
9. (take_image satellite1 phenomenon13 instrument2 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 1 of 8
10. (turn_to satellite1 phenomenon16 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 8
11. (take_image satellite1 phenomenon16 instrument2 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 2 of 8
12. (turn_to satellite1 groundstation1 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 groundstation1)
   goals met: 2 of 8
13. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 8
14. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 8
15. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 2 of 8
16. (turn_to satellite1 phenomenon13 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 8
17. (take_image satellite1 phenomenon13 instrument3 thermograph6)
   added: (have_image phenomenon13 thermograph6)
   goals met: 3 of 8
18. (turn_to satellite1 groundstation1 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 8
19. (turn_to satellite1 planet14 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet14)
   goals met: 3 of 8
20. (take_image satellite1 planet14 instrument3 image0)
   added: (have_image planet14 image0)
   goals met: 4 of 8
21. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 4 of 8
22. (take_image satellite1 planet15 instrument3 thermograph6)
   added: (have_image planet15 thermograph6)
   goals met: 5 of 8
23. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 5 of 8
24. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 5 of 8
25. (turn_to satellite1 groundstation9 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 groundstation9)
   goals met: 5 of 8
26. (calibrate satellite1 instrument4 groundstation9)
   added: (calibrated instrument4)
   goals met: 5 of 8
27. (turn_to satellite1 planet14 groundstation9)
   deleted: (pointing satellite1 groundstation9)
   added: (pointing satellite1 planet14)
   goals met: 5 of 8
28. (take_image satellite1 planet14 instrument4 infrared4)
   added: (have_image planet14 infrared4)
   goals met: 6 of 8
29. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 6 of 8
30. (take_image satellite1 planet15 instrument4 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 7 of 8
31. (turn_to satellite0 star2 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star2)
   goals met: 7 of 8
32. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 7 of 8
33. (turn_to satellite0 phenomenon16 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon16)
   goals met: 7 of 8
34. (take_image satellite0 phenomenon16 instrument1 spectrograph5)
   added: (have_image phenomenon16 spectrograph5)
   goals met: 8 of 8
